app/views/items/_form.html.erb

	<br />
	<%= f.select(:source_id, options_from_collection_for_select(@source, :id, :description, @item.source_id))%>
---
SELECT id, description FROM "sources" ORDER BY description