app/controllers/competitor_styles_controller.rb

  def index
    @competitor_styles = CompetitorStyle.all
---
SELECT "competitor_styles".* FROM "competitor_styles"