app/controllers/competitor_styles_controller.rb

  def show
    @competitor_style = CompetitorStyle.find(:first, :conditions => ["id = ?", params[:id]], :select => "id, description")
---
SELECT "competitor_styles".* FROM "competitor_styles" WHERE "competitor_styles"."id" = 1 LIMIT 1

  def edit
    @competitor_style = CompetitorStyle.find(:first, :conditions => ["id = ?", params[:id]], :select => "id, description")
---
SELECT "competitor_styles".* FROM "competitor_styles" WHERE "competitor_styles"."id" = 5 LIMIT 1

  def create
    @competitor_style = CompetitorStyle.new(params[:competitor_style])

    respond_to do |format|
      if @competitor_style.save
---
INSERT INTO "competitor_styles" ("updated_at", "description", "created_at") VALUES ('2011-07-14 00:43:58.106849', '1 Silver Undercutter / Flooder', '2011-07-14 00:43:58.106849')

  def update
    @competitor_style = CompetitorStyle.find(:first, :conditions => ["id = ?", params[:id]], :select => "id, description")

    respond_to do |format|
      if @competitor_style.update_attributes(params[:competitor_style])
---
SELECT 1 FROM "competitor_styles" WHERE ("competitor_styles"."description" = 'Flooder / 1 Silver Undercutter') AND ("competitor_styles".id <> 5) LIMIT 1
UPDATE "competitor_styles" SET "updated_at" = '2011-07-14 00:44:21.459184', "description" = 'Flooder / 1 Silver Undercutter' WHERE "competitor_styles"."id" = 5

  def destroy
    @competitor_style = CompetitorStyle.find(:first, :conditions => ["id = ?", params[:id]], :select => "id, description")
    @competitor_style.destroy
---
SELECT "competitor_styles".* FROM "competitor_styles" WHERE "competitor_styles"."id" = 1 LIMIT 1
DELETE FROM "competitor_styles" WHERE "competitor_styles"."id" = 1