app/controllers/competitors_controller.rb

  def index
    @competitors = Competitor.paginate(:page => params[:page] , :select => 'distinct id, name, competitor_style_id, source_id', :order => 'name, source_id', :conditions => ["user_id = ?", current_user.id])
    @competitor_styles = CompetitorStyle.find(:all, :select => 'id, description')
    @sources_name = Source.find(:all, :select => 'id, description')
---
SELECT "competitors".* FROM "competitors"
SELECT "competitor_styles".* FROM "competitor_styles" WHERE "competitor_styles"."id" = 4 LIMIT 1
SELECT "sources".* FROM "sources" WHERE "sources"."id" = 8 LIMIT 1

  def show
    @competitor = Competitor.find(:first, :conditions => ["id = ?", params[:id]], :select => "id, user_id, name, competitor_style_id, source_id")
---
SELECT "competitors".* FROM "competitors" WHERE "competitors"."id" = 1 LIMIT 1

  def edit
    @competitor = Competitor.find(:first, :conditions => ["id = ?", params[:id]], :select => "id, user_id, name, competitor_style_id, source_id")
---
SELECT "competitors".* FROM "competitors" WHERE "competitors"."id" = 1 LIMIT 1

  def create
    @competitor = Competitor.new(params[:competitor])

    respond_to do |format|
      if @competitor.save
---
INSERT INTO "competitors" ("updated_at", "source_id", "name", "competitor_style_id", "created_at") VALUES ('2011-07-14 01:01:51.204366', 7, 'Armando', 3, '2011-07-14 01:01:51.204366')

  def update
    @competitor = Competitor.find(:first, :conditions => ["id = ?", params[:id]], :select => "id, user_id, name, competitor_style_id, source_id")

    respond_to do |format|
      if @competitor.update_attributes(params[:competitor])
---
SELECT 1 FROM "competitors" WHERE "competitors"."source_id" = 9 AND ("competitors"."name" = 'Armando') AND ("competitors".id <> 8) LIMIT 1
UPDATE "competitors" SET "updated_at" = '2011-07-14 01:46:25.974214', "competitor_style_id" = 4, "source_id" = 9 WHERE "competitors"."id" = 8

  def destroy
    @competitor = Competitor.find(:first, :conditions => ["id = ?", params[:id]], :select => "id, user_id, name, competitor_style_id, source_id")
    @competitor.destroy
---
SELECT "competitors".* FROM "competitors" WHERE "competitors"."id" = 3 LIMIT 1
DELETE FROM "competitors" WHERE "competitors"."id" = 3