app/controllers/crafted_items_controller.rb

  def index
    @crafted_items = CraftedItem.paginate(:page => params[:page], :order => "crafted_item_generated_id")
---
SELECT "crafted_items".* FROM "crafted_items"

  def show
    @crafted_item = CraftedItem.find(params[:id])
---
SELECT "crafted_items".* FROM "crafted_items" WHERE "crafted_items"."id" = 1 LIMIT 1
SELECT "items".* FROM "items" WHERE "items"."id" = 3 LIMIT 1

  def new
    @crafted_item = CraftedItem.new
    @craft_item_ids = Item.find(:all, :conditions => "is_crafted='t'", :select => 'id, description', :order => 'description')
---
SELECT "items".* FROM "items" WHERE (isCrafted='True')

  def edit
    @crafted_item = CraftedItem.find(params[:id])
---
SELECT "crafted_items".* FROM "crafted_items" WHERE "crafted_items"."id" = 1 LIMIT 1
SELECT "items".* FROM "items" WHERE (is_crafted='t')

  def create
    @crafted_item = CraftedItem.new(params[:crafted_item])
    @craft_item_ids = Item.where("is_crafted='t'", :select => 'id, description', :order => 'description')
    @item_ids = Item.find(:all, :select => 'id, description', :order => 'description')
    respond_to do |format|
      if @crafted_item.save
---
INSERT INTO "crafted_items" ("created_at", "crafted_item_stacksize", "crafted_item_generated_id", "component_item_quantity", "updated_at", "component_item_id") VALUES ('2011-07-14 19:59:00.413551', 1, 6, 1, '2011-07-14 19:59:00.413551', 10)

  def update
    @crafted_item = CraftedItem.find(params[:id])

    respond_to do |format|
      if @crafted_item.update_attributes(params[:crafted_item])
---
SELECT "crafted_items".* FROM "crafted_items" WHERE "crafted_items"."id" = 3 LIMIT 1
UPDATE "crafted_items" SET "updated_at" = '2011-07-14 20:00:55.899098', "crafted_item_generated_id" = 7 WHERE "crafted_items"."id" = 25

  def destroy
    @crafted_item = CraftedItem.find(params[:id])
    @crafted_item.destroy
---
SELECT "crafted_items".* FROM "crafted_items" WHERE "crafted_items"."id" = 6 LIMIT 1
DELETE FROM "crafted_items" WHERE "crafted_items"."id" = 6