app/controllers/crafted_items_controller.rb

  def update
    @crafted_item = CraftedItem.find(:first, :conditions => ["id = ?", params[:id]], :select => "id, crafted_item_generated_id, crafted_item_stacksize, component_item_id, component_item_quantity")
---
SELECT 1 FROM "crafted_items" WHERE "crafted_items"."crafted_item_generated_id" = 7 AND ("crafted_items"."component_item_id" = 6) AND ("crafted_items".id <> 3) LIMIT 1