app/controllers/items_controller.rb

SELECT id, description, vendor_selling_price, vendor_buying_price, source_id FROM "items" ORDER BY description
---
  def index

    if params[:search] != nil then
      expire_action :action => :index
      @items = Item.search(params[:search], params[:page])

SELECT "items".* FROM "items" WHERE "items"."id" = 1 LIMIT 1
---
  def show
    @item = Item.find(:first, :conditions => ["id = ?", params[:id]], :select => "id, description, vendor_selling_price, vendor_buying_price, source_id, item_level, is_crafted, to_list, note")

SELECT "items".* FROM "items" WHERE "items"."id" = 1 LIMIT 1
---
  def edit
    @item = Item.find(:first, :conditions => ["id = ?", params[:id]], :select => "id, description, vendor_selling_price, vendor_buying_price, source_id, item_level, is_crafted, to_list, note")

INSERT INTO "items" ("vendor_selling_price", "source_id", "description", "vendor_buying_price", "is_crafted", "updated_at", "created_at") VALUES (NULL, 4, 'Soft Hide', 7, 'f', '2011-07-18 13:14:41.930968', '2011-07-18 13:14:41.930968')
---
  def create
    @item = Item.new(params[:item])
    @source = Source.find(:all, :select => "id, description", :order => "description")
    respond_to do |format|
      if @item.save

SELECT 1 FROM "items" WHERE ("items"."description" = 'Copper Ore') AND ("items".id <> 1) LIMIT 1
UPDATE "items" SET "updated_at" = '2011-07-12 12:28:14.590516', "source_id" = 6, "vendor_buying_price" = 26 WHERE "items"."id" = 1
---
  def update
    @item = Item.find(:first, :conditions => ["id = ?", params[:id]], :select => "id, description, vendor_selling_price, vendor_buying_price, source_id, item_level, is_crafted, to_list, note")
    @source = Source.find(:all, :select => "id, description", :order => "description")
    respond_to do |format|
      if @item.update_attributes(params[:item])

SELECT "items".* FROM "items" WHERE "items"."id" = 1 LIMIT 1
DELETE FROM "items" WHERE "items"."id" = 1
---
  def destroy
    @item = Item.find(:first, :conditions => ["id = ?", params[:id]], :select => "id, description, vendor_selling_price, vendor_buying_price, source_id, item_level, is_crafted, to_list, note")
    @item.destroy