app/controllers/listing_statuses_controller.rb

SELECT "listing_statuses".* FROM "listing_statuses" WHERE "listing_statuses"."id" = 1 LIMIT 1
---
  def show
    @listing_status = ListingStatus.find(:first, :conditions => ["id = ?", params[:id]], :select => 'id, description, position, is_final', :order => 'description')

SELECT "listing_statuses".* FROM "listing_statuses" WHERE "listing_statuses"."id" = 1 LIMIT 1
---
  def edit
    @listing_status = ListingStatus.find(:first, :conditions => ["id = ?", params[:id]], :select => 'id, description, position, is_final', :order => 'description')

INSERT INTO "listing_statuses" ("updated_at", "created_at", "description") VALUES ('2011-07-11 23:51:13.939374', '2011-07-11 23:51:13.939374', 'asdsad3243242asdsa')
---
  def create
    @listing_status = ListingStatus.new(params[:listing_status])

    respond_to do |format|
      if @listing_status.save

SELECT 1 FROM "listing_statuses" WHERE ("listing_statuses"."description" = 'sample source') AND ("listing_statuses".id <> 1) LIMIT 1
UPDATE "listing_statuses" SET "description" = 'Ongoing', "updated_at" = '2011-07-12 00:10:24.589188' WHERE "listing_statuses"."id" = 1
---
  def update
    @listing_status = ListingStatus.find(:first, :conditions => ["id = ?", params[:id]], :select => 'id, description, position, is_final', :order => 'description')
    ListingStatus.clear_cached(params[:id])
    ListingStatus.clear_cached_from_description(@listing_status.description)
    respond_to do |format|
      if @listing_status.update_attributes(params[:listing_status])

SELECT "listing_statuses".* FROM "listing_statuses" WHERE "listing_statuses"."id" = 1 LIMIT 1
DELETE FROM "listing_statuses" WHERE "listing_statuses"."id" = 1
---
  def destroy
    @listing_status = ListingStatus.find(:first, :conditions => ["id = ?", params[:id]], :select => 'id, description, position, is_final', :order => 'description')
    ListingStatus.clear_cached(params[:id])
    ListingStatus.clear_cached_from_description(@listing_status.description)
    @listing_status.destroy