app/controllers/sales_listings_controller.rb

  def show
    @sales_listing = SalesListing.find(params[:id])
    @items = Item.find(:all, :select => 'id, description, vendor_selling_price, vendor_buying_price, source_id', :order => 'description')
---
SELECT "items".* FROM "items" WHERE "items"."id" = 6 LIMIT 1