app/controllers/sales_listings_controller.rb

SELECT "listing_statuses".* FROM "listing_statuses" WHERE "listing_statuses"."id" = 2 LIMIT 1
SELECT "sales_listings".* FROM "sales_listings" WHERE "sales_listings"."id" = 5 LIMIT 1
SELECT id, description, vendor_selling_price, vendor_buying_price, source_id FROM "items" ORDER BY description
---
  def index
    if params[:status] != nil then
      if params[:status] != "0" then
        @sales_listings = SalesListing.joins("left join items on items.id = sales_listings.item_id").paginate(:page => params[:page],
        :order => "items.description, sales_listings.updated_at desc",
        :conditions => ["listing_status_id = ? and user_id = ?", params[:status], current_user[:id]])
      else
        @sales_listings = SalesListing.joins("left join listing_statuses on sales_listings.listing_status_id = listing_statuses.id").joins("left join items on items.id = sales_listings.item_id").paginate(:page => params[:page],
        :order => "position, items.description, sales_listings.updated_at desc",
        :conditions => ["user_id = ?", current_user[:id]])
      end
    else if params[:search] != nil then
        if params[:every_listings] == nil then
          @sales_listings = SalesListing.joins("left join listing_statuses on sales_listings.listing_status_id = listing_statuses.id").joins("left join items on items.id = sales_listings.item_id").where(["user_id = ? and listing_statuses.description = ?", current_user[:id], "Ongoing"]).search(params[:search], params[:page])
        else
          @sales_listings = SalesListing.joins("left join listing_statuses on sales_listings.listing_status_id = listing_statuses.id").joins("left join items on items.id = sales_listings.item_id").where(["user_id = ?", current_user[:id]]).search(params[:search], params[:page])
        end
      else
        @sales_listings = SalesListing.all_cached(current_user[:id]).paginate(:page => params[:page])

SELECT "sales_listings".* FROM "sales_listings" WHERE "sales_listings"."id" = 1 LIMIT 1
SELECT "listing_statuses".* FROM "listing_statuses" WHERE "listing_statuses"."id" = 2 LIMIT 1
---
  def show
    @sales_listing = SalesListing.find(:first, :conditions => ["id = ?", params[:id]], :select => "id, user_id, item_id, stacksize, price, is_undercut_price, deposit_cost, is_tainted, listing_status_id")
    @items = Item.all_cached_item
    @listing_statuses = ListingStatus.find(:all, :select => "id, description", :order => "description")

SELECT "items".* FROM "items" WHERE "items"."id" = 'id' LIMIT 1
SELECT "listing_statuses".* FROM "listing_statuses" WHERE "listing_statuses"."id" = 'listing_status_id' LIMIT 1
---
  def new
    @sales_listing = SalesListing.new

    @items = Item.all_cached_item_to_list
    @item_details = Item.find(:all, :select => 'id, description, vendor_selling_price, vendor_buying_price, source_id', :order => 'description', :conditions => ["id = ?", @sales_listing.item_id])

    @listing_statuses = ListingStatus.find(:all, :select => "id, description", :order => "description")

SELECT "sales_listings".* FROM "sales_listings" WHERE "sales_listings"."id" = 1 LIMIT 1
SELECT "listing_statuses".* FROM "listing_statuses" WHERE "listing_statuses"."id" = 'listing_status_id' LIMIT 1
---
  def edit
    @sales_listing = SalesListing.find(:first, :conditions => ["id = ?", params[:id]], :select => "id, user_id, item_id, stacksize, price, is_undercut_price, deposit_cost, is_tainted, listing_status_id")
    @item_details = Item.find(:all, :select => 'id, description, vendor_selling_price, vendor_buying_price, source_id', :order => 'description', :conditions => ["id = ?", @sales_listing.item_id])
    @listing_statuses = ListingStatus.find(:all, :select => "id, description", :order => "description")

INSERT INTO "sales_listings" ("stacksize", "undercut_price", "deposit_cost", "created_at", "listing_status_id", "updated_at", "item_id", "price") VALUES (1, NULL, 12, '2011-07-14 14:54:30.191355', 1, '2011-07-14 14:54:30.191355', 10, 12345)
---
  def create
    @sales_listing = SalesListing.new(params[:sales_listing])
    @listing_statuses = ListingStatus.find(:all, :select => "id, description", :order => "description")
    @items = Item.find(:all, :select => 'id, description, vendor_selling_price, vendor_buying_price, source_id', :conditions=> ["to_list = ?", true], :order => 'source_id, description')
    SalesListing.clear_all_cached(current_user[:id])
    SalesListing.clear_average_profit_cached_for_user(params[:id], current_user[:id])
    SalesListing.clear_cached_sales_percentage_full_price(params[:id], current_user[:id])
    SalesListing.clear_sold_auctions_cached_for_user(params[:id], current_user[:id])
    SalesListing.clear_sold_auctions_including_undercut_cached_for_user(params[:id], current_user[:id])
    SalesListing.clear_cached_sales_percentage_undercut_price(params[:id], current_user[:id])
    SalesListing.clear_cached_total_auctions_overall(params[:id], current_user[:id])
    SalesListing.clear_cached_sold_auctions_overall(params[:id], current_user[:id])
    respond_to do |format|
      if @sales_listing.save

SELECT "sales_listings".* FROM "sales_listings" WHERE "sales_listings"."id" = 6 LIMIT 1
UPDATE "sales_listings" SET "is_undercut_price" = 'f', "price" = 12356465, "updated_at" = '2011-07-14 17:53:15.804128' WHERE "sales_listings"."id" = 5
SELECT id, description FROM "listing_statuses" ORDER BY description
---
  def update
    @sales_listing = SalesListing.find(:first, :conditions => ["id = ?", params[:id]], :select => "id, user_id, profit, listing_status_id, item_id, stacksize, deposit_cost, price, relisted_status")
    @listing_statuses = ListingStatus.find(:all, :select => "id, description", :order => "description")
    @expired_listing = ListingStatus.find(:all, :select => 'id, description', :conditions => ["description = ?", 'Expired'])
    @inventory_listing = ListingStatus.find(:all, :select => 'id, description', :conditions => ["description = ?", 'In Inventory'])
    @sold_listing = ListingStatus.find(:all, :select => 'id, description', :conditions => ["description = ?", 'Sold'])
    @items = Item.find(:all, :select => 'id, description, vendor_selling_price, vendor_buying_price, source_id', :conditions=> ["to_list = ?", true], :order => 'source_id, description').first
    SalesListing.clear_all_cached(current_user[:id])
    SalesListing.clear_cached_prices(params[:id])
    SalesListing.clear_cached_profit(params[:id])
    SalesListing.clear_average_profit_cached_for_user(params[:id], current_user[:id])
    SalesListing.clear_cached_sales_percentage_full_price(params[:id], current_user[:id])
    SalesListing.clear_sold_auctions_cached_for_user(params[:id], current_user[:id])
    SalesListing.clear_sold_auctions_including_undercut_cached_for_user(params[:id], current_user[:id])
    SalesListing.clear_cached_sales_percentage_undercut_price(params[:id], current_user[:id])
    SalesListing.clear_cached_total_auctions_overall(params[:id], current_user[:id])
    SalesListing.clear_cached_sold_auctions_overall(params[:id], current_user[:id])
    SalesListing.clear_cached_saleslisting(params[:id])
    respond_to do |format|
      if @sales_listing.update_attributes(params[:sales_listing])

        params[:sales_listing].each do |key, value|
          if key == "listing_status_id" then
            if value.to_i ==  @expired_listing.first.id then

SELECT "sales_listings".* FROM "sales_listings" WHERE "sales_listings"."id" = 3 LIMIT 1
DELETE FROM "sales_listings" WHERE "sales_listings"."id" = 3
---
  def destroy
    @sales_listing = SalesListing.find(:first, :conditions => ["id = ?", params[:id]], :select => "id, user_id")
    if (is_current_user?(@sales_listing.user_id)) then
    SalesListing.clear_all_cached(current_user[:id])
    SalesListing.clear_cached_prices(params[:id])
    SalesListing.clear_cached_profit(params[:id])
    SalesListing.clear_average_profit_cached_for_user(params[:id], current_user[:id])
    SalesListing.clear_cached_sales_percentage_full_price(params[:id], current_user[:id])
    SalesListing.clear_cached_sales_percentage_full_price(params[:id], current_user[:id])
    SalesListing.clear_sold_auctions_cached_for_user(params[:id], current_user[:id])
    SalesListing.clear_sold_auctions_including_undercut_cached_for_user(params[:id], current_user[:id])
    SalesListing.clear_cached_sales_percentage_undercut_price(params[:id], current_user[:id])
    SalesListing.clear_cached_total_auctions_overall(params[:id], current_user[:id])
    SalesListing.clear_cached_sold_auctions_overall(params[:id], current_user[:id])
    SalesListing.clear_cached_saleslisting(params[:id])
    @sales_listing.destroy