app/controllers/sources_controller.rb

SELECT "sources".* FROM "sources" WHERE "sources"."id" = 1 LIMIT 1
---
  def show
    @source = Source.find(:first, :conditions => ["id = ?", params[:id]], :select => "id, description, crafting_allowed")

INSERT INTO "sources" ("created_at", "updated_at", "description") VALUES ('2011-07-12 01:28:09.025978', '2011-07-12 01:28:09.025978', 'sample source')
---
  def create
    @source = Source.new(params[:source])

    respond_to do |format|
      if @source.save

SELECT 1 FROM "sources" WHERE ("sources"."description" = 'sample source') AND ("sources".id <> 1) LIMIT 1
---
  def update
    @source = Source.find(:first, :conditions => ["id = ?", params[:id]], :select => "id, description, crafting_allowed")

SELECT "sources".* FROM "sources" WHERE "sources"."id" = 1 LIMIT 1
DELETE FROM "sources" WHERE "sources"."id" = 1
---
  def destroy
    @source = Source.find(:first, :conditions => ["id = ?", params[:id]], :select => "id, description, crafting_allowed")
    @source.destroy