app/views/crafted_items/_form.html.erb

    <%= f.label :crafted_item_generated_id %><br />
    <%= f.select(:crafted_item_generated_id, options_from_collection_for_select(@item_ids, :id, :description, @crafted_item.crafted_item_generated_id))%>
---
SELECT 1 FROM "crafted_items" WHERE "crafted_items"."crafted_item_generated_id" = 6 AND ("crafted_items"."crafted_item_generated_id" = 6) LIMIT 1
SELECT id, description FROM "items" ORDER BY description