app/views/sales_listings/_form.html.erb

	<br />
	<%= f.select(:item_id, options_from_collection_for_select(@items, :id, :description, @sales_listing.item_id),{},
	{#:onchange => remote_function(:action => self.determineDefaultStacksize(f),
		:onchange => "Alert(this.value)",
		:method=>:get)}) %>
---
SELECT id, description, vendor_selling_price, vendor_buying_price, source_id FROM "items" ORDER BY description

	<br />
	<%= f.select(:listing_status_id, options_from_collection_for_select(@listing_statuses, :id, :description, @sales_listing.listing_status_id)) %>
---
SELECT id, description FROM "listing_statuses" ORDER BY description