app/views/sales_listings/_form.html.erb

			<tr bgcolor="<%= @lastRowColor %>">
				<td> <%= "#{ListingStatus.find(key).description}:" %> <span align='right'><%= "#{value}" %></span></td>
---
SELECT "listing_statuses".* FROM "listing_statuses" WHERE "listing_statuses"."id" = 'listing_status_id' LIMIT 1